pipeTurbulentFlow/Processing/tmp/TurbulentFlow2/case_3/system/blockMeshDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

l 550; // [mm] lenght of cone
R 5; // [mm] biggest radiuse of cone

vertices
(
    //block0 vertices
    (-#eval{$R/4} #eval{$R/4} 0) //0
    (-#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} 0) //1
    (#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} 0) //2
    (#eval{$R/4} #eval{$R/4} 0) //3
    (-#eval{$R/4} #eval{$R/4} $l) //4
    (-#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} $l) //5
    (#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} $l) //6
    (#eval{$R/4} #eval{$R/4} $l) //7

    //block1 new vertices
    (#eval{$R/4} -#eval{$R/4} 0) //8
    (#eval{$R/sqrt(2)} -#eval{$R/sqrt(2)} 0) //9
    (#eval{$R/4} -#eval{$R/4} $l) //10
    (#eval{$R/sqrt(2)} -#eval{$R/sqrt(2)} $l) //11

    //block3 new vertices
    (-#eval{$R/4} -#eval{$R/4} 0) //12
    (-#eval{$R/sqrt(2)} -#eval{$R/sqrt(2)} 0) //13
    (-#eval{$R/4} -#eval{$R/4} $l) //14
    (-#eval{$R/sqrt(2)} -#eval{$R/sqrt(2)} $l) //15
);

xcells 8;
ycells 16;
zcells 550;

stretch 3.5;

blocks
(
    //block0
    hex (0 3 2 1 4 7 6 5) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block1
    hex (3 8 9 2 7 10 11 6)  ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block2
    hex (8 12 13 9 10 14 15 11) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block3
    hex  (12 0 1 13 14 4 5 15) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block4
    hex (0 12 8 3 4 14 10 7) ($xcells $xcells $zcells) simpleGrading (1 1 1)
);

edges
(
    //block0 arc
    arc 1 2 (0 $R 0)
    arc 5 6 (0 $R $l)

    //block1 arc
    arc 2 9 ($R 0 0)
    arc 6 11 ($R 0 $l)

    //block2 arc
    arc 9 13 (0 -$R 0)
    arc 11 15 (0 -$R $l)

    //block3 arc
    arc 1 13 (-$R 0 0)
    arc 5 15 (-$R 0 $l)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (2 3 8 9)
            (8 9 13 12)
            (13 12 0 1)
            (0 3 8 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (6 7 10 11)
            (15 11 10 14)
            (15 14 4 5)
            (4 7 10 14)
        );
    }

    pipe
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (2 6 11 9)
            (9 11 15 13)
            (15 13 5 1)
        );
    }

);

mergePatchPairs
(
);
